TestEDT/src/InformationRegisters/уа_Котировки/уа_Котировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уа_Котировки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>DefinedType.уа_Цена</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидКотировки</name>
    <type>
      <types>EnumRef.уа_ВидыКотировки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Биржа</name>
    <type>
      <types>CatalogRef.уа_Биржи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦеннаяБумага</name>
    <type>
      <types>CatalogRef.уа_ФинансовыеИнструменты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestEDT/src/InformationRegisters/уа_ПараметрыРасчетаАмортизации/уа_ПараметрыРасчетаАмортизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уа_ПараметрыРасчетаАмортизации</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЦенаАмортизации</name>
    <type>
      <types>DefinedType.уа_Цена</types>
    </type>
  </resources>
  <resources>
    <name>ЦенаНакопленногоДисконта</name>
    <type>
      <types>DefinedType.уа_Цена</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияАмортизации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭСП</name>
    <type>
      <types>DefinedType.уа_Цена</types>
    </type>
  </resources>
  <dimensions>
    <name>Портфель</name>
    <type>
      <types>CatalogRef.Портфели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦеннаяБумага</name>
    <type>
      <types>CatalogRef.уа_ФинансовыеИнструменты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestEDT/src/AccumulationRegisters/уа_РасчетыПоЦеннымБумагам/уа_РасчетыПоЦеннымБумагам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>уа_РасчетыПоЦеннымБумагам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>СуммаАмортизации</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>ПогашеннаяАмортизацияДисконта</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>СуммаПоложительнойПереоценки</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>СуммаОтрицательнойПереоценки</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>СуммаПоложительнойИндексацииНоминала</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>СуммаОтрицательнойИндексацииНоминала</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>СуммаПоложительнойКорректировки</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>СуммаОтрицательнойКорректировки</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>СуммаРезерва</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>НКД</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>УКД</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>СуммаКупонаКПолучению</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНоминалаКПолучению</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>DefinedType.уа_Стоимость</types>
    </type>
  </resources>
  <dimensions>
    <name>Портфель</name>
    <type>
      <types>CatalogRef.Портфели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦеннаяБумага</name>
    <type>
      <types>CatalogRef.уа_ФинансовыеИнструменты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОценочнаяКатегория</name>
    <type>
      <types>EnumRef.уа_ОценочнаяКатегория</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

TestEDT/src/Enums/уа_ВидыКотировки/уа_ВидыКотировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уа_ВидыКотировки</name>
  <enumValues>
    <name>РыночнаяЦена2</name>
  </enumValues>
  <enumValues>
    <name>ЦенаСпроса</name>
  </enumValues>
  <enumValues>
    <name>ЦенаПредложения</name>
  </enumValues>
  <enumValues>
    <name>ЦенаНРД</name>
  </enumValues>
  <enumValues>
    <name>Купон</name>
  </enumValues>
  <enumValues>
    <name>Номинал</name>
  </enumValues>
  <enumValues>
    <name>КоличествоСделок</name>
  </enumValues>
  <enumValues>
    <name>СправедливаяСтоимость</name>
  </enumValues>
</mdclass:Enum>

TestEDT/src/Enums/уа_ОценочнаяКатегория/уа_ОценочнаяКатегория.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уа_ОценочнаяКатегория</name>
  <enumValues>
    <name>АктивыПоСправедливойСтоимостиПрибыль</name>
  </enumValues>
  <enumValues>
    <name>АктивыДляПерепродажи</name>
  </enumValues>
  <enumValues>
    <name>ИнвестицииДоПогашения</name>
  </enumValues>
  <enumValues>
    <name>АктивыПоАмортизированнойСтоимости</name>
  </enumValues>
</mdclass:Enum>

TestEDT/src/Documents/уа_ПереоценкаАмортизацияЦенныхБумаг/уа_ПереоценкаАмортизацияЦенныхБумаг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уа_ПереоценкаАмортизацияЦенныхБумаг</name>
  <registerRecords>AccountingRegister.ЕПС</registerRecords>
  <registerRecords>AccumulationRegister.уа_РасчетыПоЦеннымБумагам</registerRecords>
  <attributes>
    <name>Портфель</name>
    <type>
      <types>CatalogRef.Портфели</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценочнаяКатегория</name>
    <type>
      <types>EnumRef.уа_ОценочнаяКатегория</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Активы</name>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦеннаяБумага</name>
      <type>
        <types>CatalogRef.уа_ФинансовыеИнструменты</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>КратностьЦБ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсЦБ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАмортизации</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАмортизацииВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПереоценки</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПереоценкиВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>НКД</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>НКДВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаИндексацииНоминала</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаИндексацииНоминалаВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКорректировки</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКорректировкиВал</name>
      <type>
        <types>DefinedType.уа_Стоимость</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TestEDT/src/CommonModules/уа_ОперативныйУчет/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПодготовитьСтруктуруТаблицыЗначений()
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ = Документы.уа_ПереоценкаАмортизацияЦенныхБумаг.ПустаяСсылка().Активы.ВыгрузитьКолонки();
	
	// ТЗ.Колонки.Добавить("ЦеннаяБумага", Новый ОписаниеТипов("Справочник.уа_ФинансовыеИнструменты"));
	
	Возврат ТЗ;
КонецФункции

// Заполняет данные переоценки/амортизации
Функция РассчитатьПереоценкуАмортизацию(МоментВремени, Портфель, ОценочнаяКатегория) Экспорт
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"	ВЫБРАТЬ 
	|		ЦеннаяБумага, 
	|		Валюта,
	|		МАКСИМУМ(ВЫБОР КОГДА ВидКотировки = ЗНАЧЕНИЕ(Перечисление.уа_ВидыКотировки.СправедливаяСтоимость) ТОГДА Значение ИНАЧЕ 0 КОНЕЦ) КАК СправедливаяСтоимость,
	|		МАКСИМУМ(ВЫБОР КОГДА ВидКотировки = ЗНАЧЕНИЕ(Перечисление.уа_ВидыКотировки.Купон) ТОГДА Значение ИНАЧЕ 0 КОНЕЦ) КАК Купон,
	|		МАКСИМУМ(ВЫБОР КОГДА ВидКотировки = ЗНАЧЕНИЕ(Перечисление.уа_ВидыКотировки.Номинал) ТОГДА Значение ИНАЧЕ 0 КОНЕЦ) КАК Номинал
	|	ПОМЕСТИТЬ ВТ_Котировки
	|	ИЗ РегистрСведений.уа_Котировки.СрезПоследних(&Дата)
	|	СГРУППИРОВАТЬ ПО ЦеннаяБумага, Валюта
	|	ИНДЕКСИРОВАТЬ ПО ЦеннаяБумага;     
	|	
	|	ВЫБРАТЬ Валюта, Курс, Кратность
	|	ПОМЕСТИТЬ ВТ_КурсыВалют
	|	ИЗ РегистрСведений.КурсыВалют.СрезПоследних(&Дата)
	|	ИНДЕКСИРОВАТЬ ПО Валюта;
	|			
	|	ВЫБРАТЬ 
	|		Партия, 
	|		ЦенаАмортизации,
	|		ЦенаНакопленногоДисконта,
	|		ДатаОкончанияАмортизации,
	|		ЭСП
	|	ПОМЕСТИТЬ ВТ_ПараметрыРасчетаАмортизации
	|	ИЗ РегистрСведений.уа_ПараметрыРасчетаАмортизации.СрезПоследних(&Дата, Портфель= &Портфель)
	|	ИНДЕКСИРОВАТЬ ПО Партия;
	|	
	|	ВЫБРАТЬ 
	|		О.ЦеннаяБумага,
	|		О.Партия,
	|		О.Валюта,
	|		О.КоличествоОстаток КАК Количество,
	|		О.СуммаОстаток КАК СуммаВал, 
	|		О.УКДОстаток КАК УКДВал,
	|		О.СуммаРезерваОстаток КАК СуммаРезерваПодОбесценениеВал,
	|		О.СуммаКупонаКПолучениюОстаток КАК СуммаКупонаКПолучениюВал,
	|		О.СуммаНоминалаКПолучениюОстаток КАК СуммаНоминалаКПолучениюВал,
	|		О.СуммаОстаток + О.СуммаАмортизацииОстаток + О.НКДОстаток + О.УКДОстаток + 
	|			О.СуммаПоложительнойПереоценкиОстаток + О.СуммаОтрицательнойПереоценкиОстаток + 
	|			О.СуммаПоложительнойКорректировкиОстаток + О.СуммаОтрицательнойКорректировкиОстаток +
	|			О.СуммаПоложительнойИндексацииНоминалаОстаток + О.СуммаОтрицательнойИндексацииНоминалаОстаток +
	|			О.СуммаРезерваОстаток + СуммаКупонаКПолучениюОстаток + СуммаНоминалаКПолучениюОстаток КАК БалансоваяСтоимостьВал,
	|		О.ПогашеннаяАмортизацияДисконтаОстаток КАК ПогашеннаяАмортизацияДисконта,
	|		ЕСТЬNULL(А.ЦенаАмортизации,0) КАК ЦенаАмортизации,
	|		ЕСТЬNULL(А.ЦенаНакопленногоДисконта,0) КАК ЦенаНакопленногоДисконта,
	|		О.Партия.Дата КАК ДатаНачалаАмортизации,
	|		А.ДатаОкончанияАмортизации,
	|		ЕСТЬNULL(А.ЭСП,0) КАК ЭСП,
	|		ЕСТЬNULL(К.СправедливаяСтоимость,0) КАК СправедливаяСтоимость,
	|		ЕСТЬNULL(К.Купон,0) КАК Купон,
	|		ЕСТЬNULL(К.Номинал,0) КАК Номинал,
	|		КВ.Курс КАК КурсЦБ,
	|		КВ.Кратность КАК КратностьЦБ			
	|	ИЗ РегистрНакопления.уа_РасчетыПоЦеннымБумагам.Остатки(&Дата, Портфель = &Портфель И ОценочнаяКатегория=&ОценочнаяКатегория) О
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.уа_ФинансовыеИнструменты ФИ ПО О.ЦеннаяБумага = ФИ.Ссылка И О.Валюта = ФИ.ВалютаНоминала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыРасчетаАмортизации А ПО А.Партия = О.Партия     
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Котировки К ПО О.ЦеннаяБумага = К.ЦеннаяБумага  
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КурсыВалют КВ ПО О.Валюта = КВ.Валюта
	|	УПОРЯДОЧИТЬ ПО О.ЦеннаяБумага, О.Партия АВТОУПОРЯДОЧИВАНИЕ;
	|	
	|	УНИЧТОЖИТЬ ВТ_Котировки;
	|	УНИЧТОЖИТЬ ВТ_КурсыВалют;
	|	УНИЧТОЖИТЬ ВТ_ПараметрыРасчетаАмортизации;";
	
	Дата = НачалоДня(МоментВремени.Дата);
	Запрос.УстановитьПараметр("Портфель", Портфель);
	Запрос.УстановитьПараметр("ОценочнаяКатегория", ОценочнаяКатегория);
	Запрос.УстановитьПараметр("Дата", Дата);	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени, ВидГраницы.Исключая));

	ТЗ = ПодготовитьСтруктуруТаблицыЗначений();
		
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат ТЗ;
	КонецЕсли;
	
	ЦеннаяБумага = Неопределено;
	
	Выборка = Результат.Выбрать();	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЦеннаяБумага <> ЦеннаяБумага Тогда
			КоличествоОбщее 		= 0;	
			НКДВалОбщая 			= 0;
			СуммаПереоценкиВалОбщая = 0;
			ЦеннаяБумага 			= Выборка.ЦеннаяБумага;
		КонецЕсли;	
		
		Строка = ТЗ.Добавить();		
		Строка.ЦеннаяБумага 	= Выборка.ЦеннаяБумага;
		Строка.Партия 			= Выборка.Партия;	
		Строка.Валюта 			= Выборка.Валюта;
		Строка.КурсЦБ		 	= Выборка.КурсЦБ;
		Строка.КратностьЦБ		= Выборка.КратностьЦБ;		
				
		Строка.СуммаИндексацииНоминалаВал	= 0;
		Строка.СуммаИндексацииНоминала		= 0;
		Строка.СуммаАмортизацииВал 	= 0;
		Строка.СуммаАмортизации 	= 0;
		Строка.НКДВал 				= 0;
		Строка.НКД					= 0;
		Строка.СуммаКорректировкиВал= 0;
		Строка.СуммаКорректировки 	= 0;
		Строка.СуммаПереоценкиВал 	= 0;
		Строка.СуммаПереоценки  	= 0;			
		
		Если Выборка.ЦенаАмортизации <> 0 И Дата <= Выборка.ДатаОкончанияАмортизации Тогда
			Коэффициент = (Дата - Выборка.ДатаНачалаАмортизации)/(Выборка.ДатаОкончанияАмортизации - Выборка.ДатаНачалаАмортизации);
			// расчет премии
			Если Выборка.ЦенаАмортизации > 0 Тогда
				Строка.СуммаАмортизацииВал = Окр(Выборка.ЦенаАмортизации * Выборка.Количество * (1-Коэффициент), 2);
			// расчет дисконта
			ИначеЕсли Выборка.ЦенаАмортизации < 0 Тогда
				Строка.СуммаАмортизацииВал = Окр(Выборка.ЦенаНакопленногоДисконта * Выборка.Количество, 2) 
					+ Окр( Окр((Выборка.ЦенаАмортизации - Выборка.ЦенаНакопленногоДисконта) * Выборка.Количество, 2) * Коэффициент, 2)
					+ Выборка.ПогашеннаяАмортизацияДисконта;					
			КонецЕсли;
			Строка.СуммаАмортизации = Окр(Строка.СуммаАмортизацииВал * Выборка.КурсЦБ / Выборка.КратностьЦБ,2);
		КонецЕсли;
		
		// для индексированных бумаг
		Если Выборка.ЦеннаяБумага.ИндексируемыйНоминал Тогда
			Строка.СуммаИндексацииНоминалаВал	= (Выборка.Номинал + ?(Выборка.ЦенаАмортизации < 0, Выборка.ЦенаАмортизации,0) ) * Выборка.Количество - Выборка.СуммаОстаток;
			Строка.СуммаИндексацииНоминала 		= Окр(Строка.СуммаИндексацииНоминалаВал * Выборка.КурсЦБ / Выборка.КратностьЦБ,2);
		КонецЕсли;
		
		КоличествоОбщее 		= КоличествоОбщее + Выборка.Количество;
		
		Если Выборка.Купон > 0 Тогда
			Строка.НКДВал 			 	= Окр(Выборка.Количество * Выборка.Купон, 2);
			НКДВалОбщая				 	= НКДВалОбщая + Строка.НКДВал;		
			НКДВалРазница			  	= Окр(КоличествоОбщее * Выборка.Купон,2) - НКДВалОбщая;
			НКДВалОбщая					= НКДВалОбщая - НКДВалРазница;		 
			Строка.НКДВал				= Строка.НКДВал - НКДВалРазница - Выборка.УКДВал;
			Строка.НКД					= Окр(Строка.НКДВал * Выборка.КурсЦБ / Выборка.КратностьЦБ,2);
		КонецЕсли;
			
		Если ОценочнаяКатегория = Перечисления.уа_ОценочнаяКатегория.АктивыПоСправедливойСтоимостиПрибыль Тогда			
			Строка.СуммаПереоценкиВал 	= Окр(Выборка.Количество * Выборка.СправедливаяСтоимость,2);
			СуммаПереоценкиВалОбщая 	= СуммаПереоценкиВалОбщая + Строка.СуммаПереоценкиВал;
			СуммаПереоценкиВалРазница 	= Окр(КоличествоОбщее * Выборка.СправедливаяСтоимость,2) - СуммаПереоценкиВалОбщая;
			СуммаПереоценкиВалОбщая 	= СуммаПереоценкиВалОбщая - СуммаПереоценкиВалРазница;
			Строка.СуммаПереоценкиВал  	= Строка.СуммаПереоценкиВал - СуммаПереоценкиВалРазница 
				- Выборка.СуммаВал - Строка.СуммаАмортизацииВал - Строка.СуммаИндексацииНоминалаВал;
			Строка.СуммаПереоценки		= Окр(Строка.СуммаПереоценкиВал * Выборка.КурсЦБ / Выборка.КратностьЦБ,2);
			
		ИначеЕсли ОценочнаяКатегория = Перечисления.уа_ОценочнаяКатегория.АктивыПоАмортизированнойСтоимости Тогда
			Строка.СуммаКорректировкиВал=  Окр(Выборка.БалансоваяСтоимостьВал * Pow(1.0 + Выборка.ЭСП/100, 1/365), 2) 
				- (Выборка.СуммаВал + Строка.НКДВал + Выборка.УКДВал + Выборка.СуммаКупонаКПолучениюВал + Выборка.СуммаНоминалаКПолучениюВал + Строка.АмортизацияВал 
				+ Строка.СуммаИндексацииНоминалаВал + Строка.СуммаРезерваПодОбесценениеВал);
			Строка.СуммаКорректировки 	= Окр(Строка.СуммаКорректировкиВал * Выборка.КурсЦБ / Выборка.КратностьЦБ,2);
		КонецЕсли;			
		 		
	КонецЦикла;
	
	Возврат ТЗ;
КонецФункции
 
#КонецОбласти
